# CLI
brew "git"
brew "bash"
brew "xcodegen"
brew "uv"

# Window manager and switcher are built from vendor/ forks (modules 30, 55)

# Terminal
cask "kitty"
cask "font-jetbrains-mono-nerd-font"

# Key remapping (Cmd+Tab disable lives in config/karabiner/karabiner.json)
cask "karabiner-elements"

# Clipboard history

# Automation: redmi pad screenshot tool (macos_automation_scripts)
cask "hammerspoon"
cask "android-platform-tools"

# IDE
cask "visual-studio-code"

# Office
cask "microsoft-word"
cask "microsoft-excel"
cask "microsoft-powerpoint"

# Media
cask "spotify"
cask "ayugram"

# vpn
cask "amneziavpn"
cask "logmein-hamachi"

# java
brew "openjdk@17"

# cloud storage
cask "google-drive"

# editor: neovim itself is the nightly build (module 60); these are LazyVim picker deps
brew "ripgrep"
brew "fd"

# controls
cask "linearmouse"

# dictionary / translation
cask "easydict"

# password manager
cask "bitwarden"

# AI
cask "claude"
cask "chatgpt"
brew "kimi-code"
